brew 'ast-grep'
brew 'bat'
brew 'difftastic'
brew 'eza'
brew 'fish'
brew 'gh'
brew 'git'
brew 'gitmoji'
brew 'git-delta'
brew 'gnupg'
brew 'lazygit'
brew 'mas'
brew 'mise'
brew 'neovim'
brew 'pgcli'
brew 'pinentry-mac'
brew 'pnpm'
brew 'reattach-to-user-namespace'
brew 'starship'
brew 'tldr'

# Yazi (and the optional dependencies):
brew 'yazi'
brew 'fd'
brew 'ffmpeg-full'
cask 'font-symbols-only-nerd-font'
brew 'fzf'
brew 'imagemagick-full'
brew 'jq'
brew 'poppler'
brew 'resvg'
brew 'ripgrep'
brew 'sevenzip'
brew 'zoxide'

# Lazyvim dependencies
brew 'grpcurl'
brew 'websocat'
brew 'luarocks'
brew 'rust-analyzer'

tap 'thoughtbot/formulae'
brew 'rcm'

cask_args appdir: '/Applications'
cask '1password'
cask 'arc'
cask 'claude-code'
cask 'contexts'
cask 'handy'
cask 'homebrew/cask/gitup'
cask 'kitty'
cask 'licecap'
cask 'obsidian'
cask 'raycast'
cask 'shottr'
cask 'sublime-text'
cask 'visual-studio-code'

cask 'font-caskaydia-mono-nerd-font'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-ia-writer-mono'
cask 'font-ia-writer-duo'
cask 'font-ia-writer-quattro'
cask 'font-ibm-plex'
cask 'font-intel-one-mono'
cask 'font-monoid'
cask 'font-victor-mono'
cask 'font-source-code-pro'
cask 'font-work-sans'

mas 'Fantastical', id: 975_937_182
mas 'Flow', id: 1_423_210_932
mas 'Googly Eyes', id: 6_743_048_714
mas 'HazeOver', id: 430_798_174
mas 'iA Writer', id: 775_737_590
mas 'Things', id: 904_280_696
