tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
brew 'fasd'
brew 'fzf'
brew 'git'
brew 'github/gh/gh'
brew 'hub'
brew 'mas'
brew 'nodenv'
brew 'pinentry-mac'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'ruby-build'
brew 'tldr'
brew 'tmux'
brew 'tmuxinator-completion'
brew 'yarn'
brew 'zplug'
brew 'zsh'

tap 'thoughtbot/formulae'
brew 'rcm'

tap 'caskroom/cask'
cask_args appdir: '/Applications'
cask 'alfred'
cask 'discord'
cask 'gitup'
cask 'hazel'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'iterm2'
cask 'keycastr'
cask 'licecap'
cask 'postico'
cask 'raindropio'
cask 'slack'
cask 'spectrum'
cask 'sublime-text'
cask 'taskpaper'
cask 'visual-studio-code'
cask 'whatsapp'

tap 'caskroom/fonts'
cask 'font-cascadia'
cask 'font-courier-prime'
cask 'font-courier-prime-code'
cask 'font-courier-prime-sans'
cask 'font-courier-prime-medium-and-semi-bold'
cask 'font-fantasque-sans-mono'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-firacode-nerd-font'
cask 'font-hack'
cask 'font-ia-writer-duospace'
cask 'font-ia-writer-quattro'
cask 'font-ibm-plex'
cask 'font-inconsolata'
cask 'font-iosevka'
cask 'font-iosevka-nerd-font'
cask 'font-monoid'
cask 'font-source-code-pro'

mas '1Password', id: 443987910
mas 'Amphetamine', id: 937984704
mas 'Cardhop', id: 1290358394
mas 'DaisyDisk', id: 411643860
mas 'Fantastical 2', id: 975937182
mas 'iA Writer', id: 775737590
mas 'Moom', id: 419330170
mas 'Pixelmator', id: 407963104
mas 'Snappy', id: 512617038
mas 'Spark', id: 1176895641
mas 'Soulver', id: 413965349
mas 'Things 3', id: 904280696
