edc/bass
fisherman/debug
oh-my-fish/plugin-fasd
fisherman/getopts
fisherman/git_util
fisherman/host_info
fisherman/humanize_duration
fisherman/last_job_id
fisherman/metro
fisherman/pwd_info
fisherman/pwd_is_home
fisherman/segment
